---
kind: type
id: T:Autodesk.Revit.DB.Infrastructure.Alignment
source: html/6594712d-3b22-9b08-ab4c-782df88f36d1.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment

Represents an object which provides access to an underlying Revit alignment element.

## Syntax (C#)
```csharp
public class Alignment
```

## Remarks
The element is a DirectShape .
 The element's category is OST_Alignments .